from copy import deepcopy
from math import sqrt
from typing import Callable, Dict, List, Set, Tuple


def priority_enqueue(pq: List, element: Tuple[int, int], priority: int | float):
    pq.append((element, priority))
    pq.sort(key=lambda x: x[1])  # mutates pq (pass-by-ref is so weird in python)
    return


def priority_queue_get(pq, needle):
    for node, priority in pq:
        if node == needle:
            return (node, priority)
    return None


def priority_queue_update(pq, element, priority):
    for i, node in enumerate(pq):
        if node[0] == element:
            pq[i] = (element, priority)
            return


def priority_dequeue(pq: List):
    return pq.pop(0)[0]


def get_neighbors(world: List[List[str]], node: Tuple[int, int], moves: List[Tuple[int, int]]) -> List[Tuple[int, int]]:
    max_x = len(world[0]) - 1  # Assumes all rows are the same size
    max_y = len(world) - 1
    valid_moves: List[Tuple[int, int]] = []

    for dx, dy in moves:
        x: int = node[0] + dx
        y: int = node[1] + dy
        if 0 <= x <= max_x and 0 <= y <= max_y and world[y][x] != "🌋":
            valid_moves.append((x, y))
    return valid_moves


def heuristic(start: Tuple[int, int], goal: Tuple[int, int]) -> int | float:
    distance = sqrt(((goal[0] - start[0]) ** 2) + ((goal[1] - start[1]) ** 2))  # euclidean distance?
    # distance = 0
    return distance


def a_star_search(
    world: List[List[str]],
    start: Tuple[int, int],
    goal: Tuple[int, int],
    costs: Dict[str, int],
    moves: List[Tuple[int, int]],
    heuristic: Callable,
) -> List[Tuple[int, int]]:
    ### YOUR SOLUTION HERE ###
    ### YOUR SOLUTION HERE ###
    pq: List[Tuple[int, int]] = []

    explored: Set[Tuple[int, int]] = set()

    parents: Dict[Tuple[int, int], Tuple[int, int]] = {}  # child -> parent map

    path_costs = {start: 0.0}

    priority_enqueue(pq, start, 0)

    while pq:  # Check if more neighbors to traverse
        node: Tuple[int, int] = priority_dequeue(pq)

        if node == goal:  # backtrack
            actions = []
            while node != start:
                parent = parents[node]
                actions.append((node[0] - parent[0], node[1] - parent[1]))
                node = parent
            return actions[::-1]  # reverse actions

        explored.add(node)

        for neighbor in get_neighbors(world, node, moves):  # add nodes to frontier
            if neighbor not in explored:
                cost = path_costs[node] + costs[world[neighbor[1]][neighbor[0]]]

                if neighbor not in path_costs or cost < path_costs[neighbor]:
                    priority: float = cost + heuristic(neighbor, goal)
                    priority_enqueue(pq, neighbor, priority)

                    # store for later
                    parents[neighbor] = node
                    path_costs[neighbor] = cost
    return []


def pretty_print_path(world: List[List[str]], path: List[Tuple[int, int]], start: Tuple[int, int], goal: Tuple[int, int], costs: Dict[str, int]) -> int:
    ### YOUR SOLUTION HERE ###
    ### YOUR SOLUTION HERE ###
    total_cost = 0
    x = start[0]
    y = start[1]

    map = deepcopy(world)
    map[goal[1]][goal[0]] = "🎁"

    for dx, dy in path:
        node = (x + dx, y + dy)
        total_cost += costs[world[y][x]]
        tile = map[y][x]
        if (dx, dy) == (0, 1):
            tile = "⏬"
        elif (dx, dy) == (1, 0):
            tile = "⏩"
        elif (dx, dy) == (-1, 0):
            tile = "⏪"
        elif (dx, dy) == (0, -1):
            tile = "⏫"
        map[y][x] = tile
        x, y = node

    for y, row in enumerate(map):
        for x, tile in enumerate(row):
            print(tile, end="")
        print("\n")
    return total_cost


small_world = [
    ["🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🐊", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "⛰", "⛰", "⛰"],
    ["🌾", "🌾", "🌾", "🌾", "🌾", "⛰", "⛰", "🌾", "🌾", "🌾", "🌾", "🐊", "🐊", "🐊", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "⛰", "🌋", "🌋", "⛰"],
    ["🌾", "🌾", "🌾", "🌾", "🌾", "⛰", "⛰", "⛰", "🌾", "🌾", "🐊", "🐊", "🐊", "🐊", "🌾", "🌾", "🌋", "🌾", "🌾", "🌾", "⛰", "🌾", "🌾", "⛰", "⛰", "🌋", "🌾"],
    ["🌾", "🌾", "🌾", "🌾", "⛰", "⛰", "🌋", "⛰", "⛰", "🐊", "🐊", "🐊", "🐊", "🐊", "🌾", "🌋", "🌋", "🌋", "🌋", "🌾", "⛰", "🌾", "🌾", "🌾", "⛰", "🌋", "🌾"],
    ["🌾", "🌾", "🌋", "⛰", "⛰", "🌋", "🌋", "⛰", "⛰", "🐊", "🐊", "🐊", "🐊", "🐊", "🌋", "🌋", "🌲", "🌋", "🌋", "🌋", "⛰", "⛰", "🌾", "🌾", "⛰", "⛰", "🌾"],
    ["🌲", "🌾", "🌋", "🌋", "🌋", "🌋", "⛰", "⛰", "⛰", "🐊", "🐊", "🐊", "🌾", "🌾", "🌾", "🌋", "🌲", "🌲", "🌋", "🌋", "⛰", "⛰", "🌾", "⛰", "⛰", "🌾", "🌾"],
    ["🌲", "🌾", "🌲", "🌋", "🌋", "⛰", "⛰", "⛰", "🌾", "🌾", "🐊", "🌾", "🌾", "🌾", "🌾", "🌲", "🌲", "🌲", "🌲", "🌋", "🌋", "⛰", "⛰", "⛰", "🌾", "🌾", "🌾"],
    ["🌲", "🌲", "🌲", "🌋", "🌲", "⛰", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "⛰", "⛰", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌋", "🌋", "⛰", "⛰", "🌾", "🌾", "🌾"],
    ["🌲", "🌲", "🌲", "🌲", "🌲", "🌾", "🌾", "🌾", "🌾", "⛰", "⛰", "⛰", "⛰", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌋", "⛰", "⛰", "🌾", "🌾", "🌾"],
    ["🌲", "🌲", "🌲", "🌲", "🌾", "🌾", "🌾", "🌾", "🌾", "⛰", "⛰", "🌋", "🌋", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌋", "🌋", "⛰", "🌾", "🌾", "🌾"],
    ["🌲", "🌲", "🌲", "🌲", "🌾", "🌾", "🌾", "🌾", "🌾", "⛰", "🌋", "🌋", "🌋", "⛰", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌋", "🌾", "🌾", "⛰", "🌾"],
    ["🌲", "🌲", "🌲", "🌲", "🐊", "🌾", "⛰", "🌾", "🌾", "🌋", "🌋", "⛰", "⛰", "🌾", "⛰", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌋", "🌾", "🌋", "⛰", "🌾"],
    ["🌲", "🌲", "🌲", "🐊", "🐊", "🐊", "🌋", "🌾", "⛰", "🌋", "🌋", "🌾", "🌾", "🌾", "⛰", "🌋", "🌲", "🌲", "🌲", "🌲", "🌲", "🌋", "🌋", "🌾", "🌋", "🌋", "⛰"],
    ["🌲", "🌲", "🌲", "🐊", "🐊", "🐊", "🌋", "⛰", "⛰", "🌋", "⛰", "🌾", "🐊", "🌾", "⛰", "🌋", "🌲", "🌲", "🌲", "🌾", "🌾", "🌋", "🌾", "🌾", "🌋", "🌋", "⛰"],
    ["🌲", "🌲", "🌲", "🌲", "🐊", "🐊", "🌋", "🌋", "🌋", "🌋", "🌾", "🌾", "🐊", "🌾", "⛰", "🌋", "🌋", "🌲", "🌾", "🌾", "🌋", "🌾", "🌾", "🌾", "⛰", "🌋", "⛰"],
    ["🌾", "🌲", "🌲", "🌲", "🌲", "🐊", "🐊", "🌋", "🌋", "🌾", "🌾", "🌾", "🐊", "🐊", "🌾", "⛰", "🌋", "🌲", "🌾", "🌾", "🌾", "🌾", "🌾", "⛰", "⛰", "🌋", "⛰"],
    ["🌾", "🌾", "🌲", "🌲", "🌲", "🐊", "🐊", "🌋", "🌾", "🌾", "🌾", "🐊", "🐊", "🐊", "🐊", "⛰", "🌋", "🌋", "🌾", "🌾", "🌾", "🌾", "🌾", "⛰", "🌋", "⛰", "⛰"],
    ["🌾", "🌾", "🌋", "🌲", "🌲", "🌾", "🐊", "🐊", "🐊", "🌾", "🌾", "🐊", "🌾", "🐊", "🐊", "🌾", "🌾", "🌋", "⛰", "🌾", "🌾", "🌾", "⛰", "🌋", "🌋", "⛰", "🌾"],
    ["🌾", "🌋", "🌋", "🌲", "🌾", "🌾", "🌾", "🐊", "🐊", "🐊", "🌾", "🌾", "🌾", "🐊", "🐊", "🐊", "🌾", "🌋", "⛰", "🌾", "🌾", "🌾", "⛰", "🌋", "🌾", "⛰", "🌾"],
    ["🌾", "🌋", "🌋", "🌾", "🌾", "🌾", "🌾", "🐊", "🌾", "🌾", "⛰", "🌾", "🌾", "🌾", "🌾", "🌾", "🌋", "🌋", "🌾", "🌾", "🌾", "🌾", "🌾", "⛰", "🌋", "⛰", "🌾"],
    ["🌾", "🌋", "⛰", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "⛰", "🌋", "⛰", "⛰", "🌾", "🌾", "⛰", "🌋", "🌾", "🌾", "🌾", "🐊", "🐊", "🌾", "⛰", "🌋", "🌋", "🌾"],
    ["🌾", "🌋", "⛰", "⛰", "⛰", "🌾", "🌾", "🌾", "⛰", "⛰", "🌋", "🌋", "🌋", "⛰", "⛰", "🌋", "🌋", "🌾", "🌾", "🌾", "🐊", "🐊", "🐊", "🌾", "⛰", "🌋", "⛰"],
    ["🌾", "🌋", "⛰", "⛰", "🌋", "⛰", "🌾", "⛰", "⛰", "⛰", "🌋", "🌋", "⛰", "🌾", "🌋", "🌋", "🌾", "🌾", "🌾", "🌾", "🐊", "🐊", "🐊", "🐊", "⛰", "🌋", "⛰"],
    ["🌾", "🌋", "🌋", "🌋", "🌋", "🌋", "⛰", "⛰", "⛰", "🌾", "⛰", "⛰", "🌾", "🌾", "⛰", "⛰", "🌾", "🌾", "🌾", "🐊", "🐊", "🐊", "🐊", "🐊", "🐊", "🐊", "⛰"],
    ["🌾", "🌋", "🌋", "🌋", "🌋", "⛰", "🌾", "⛰", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🐊", "🐊", "🐊", "🐊", "🐊", "🐊", "🐊", "🌾"],
    ["🌾", "🌾", "⛰", "⛰", "⛰", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🐊", "🐊", "🐊", "🐊", "🐊", "🐊", "🐊", "🌾"],
    ["🌾", "🌾", "⛰", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🐊", "🐊", "🐊", "🐊", "🐊", "🐊", "🐊", "🌾"],
]

# small_world = [
#     ["🌾", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲"],
#     ["🌾", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲"],
#     ["🌾", "🌲", "🌲", "🌲", "🌲", "🌲", "🌲"],
#     ["🌾", "🌾", "🌾", "🌾", "🌾", "🌾", "🌾"],
#     ["🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌾"],
#     ["🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌾"],
#     ["🌲", "🌲", "🌲", "🌲", "🌲", "🌲", "🌾"],
# ]

MOVES = [(0, -1), (1, 0), (0, 1), (-1, 0)]
COSTS = {"🌾": 1, "🌲": 3, "⛰": 5, "🐊": 7}

world = small_world

start = (0, 0)
goal = (len(small_world[0]) - 1, len(small_world) - 1)
costs = COSTS
moves = MOVES
actions = a_star_search(world, start, goal, costs, moves, heuristic)
print(actions)
total_cost = pretty_print_path(world, actions, start, goal, costs)
print(total_cost)
